Emacs/DotFiles.org
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
:END:

#+title: 用org-mode配置所有dotfile
#+property: header-args:emacs-lisp :tangle ~/.emacs.d/init.el

* 用org-babel配置所有的dotfile

** Org-babel

   org-mode 可以执行代码块用的是org-babel的功能
   =org-babel-tangle(C-c C-v t)= 是一个macs内置的方法,用来将org文件中的代码块写入到指定的文件中,理论上可以利用这个方法配置一切基于文本文件配置的软件
   #+begin_src emacs-lisp :tangle ./delete_me.el
     (message "some text ")
   #+end_src

   #+begin_quote
   要让这个org文件能起到配置作用:
   - 头信息中配置好代码块tangle的目标文件
   - 想对其他语言的代码块也生效需要配置 =org-babel-do-load-languages=
   #+end_quote

   上面的例子里在代码块的 =:tangle= 属性中设置了目标文件的位置，如果代码块很多，总不能每一个都手动去指定吧，这里就可以用到org文件的头信息，
   =#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el=,就像这个文件的头信息一样，将 emacs-lisp代码块的 =tangle= 属性设置为一个默认值，这个属性被所有 emacs-lisp 代码块继承.
   和OB思想一样，如果代码块另外指定了目标文件的位置，那就会使用指定的，而不是头信息的默认属性.
  
** 将一个代码块的执行结果或返回值传递给另一个代码块
   eamcs默认执行的只有emacs-lisp语言的代码块,开启其他语言的代码块执行功能需要添加配置:
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init.el
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (python . t)
        (dot . t)
        (shell . t)
        ;; (browser . t)
        (js . t)
        ))
     (push '("conf-unix" . conf-unix) org-src-lang-modes)
     ;; 每次执行不会询问是否执行
     (setq org-confirm-babel-evaluate nil)
     ;;(message "hello")
   #+end_src

   #+NAME: block_name
   #+begin_src python :results value 
     import random
     return random.randint(0,100)
   #+end_src
   上面的代码块有名字 =block_name=,下面载配置文件的过程就是执行一系列emacs-lisp的过程,所以有时候顺序很重要
  
** 每次保存这个文件自动执行 =org-bable-tangle=
   #+begin_src emacs-lisp
     (defun efs/org-babel-tangle-config()
       (when (string-equal (buffer-file-name)
                           (expand-file-name "~/MyLife/Emacs/DotFiles.org"))
         (let ((org-confirm-babel-evaluate nil))
           (org-babel-tangle))))
     (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
   #+end_src

* Emacs

** 显示emacs启动时间
   #+begin_src emacs-lisp
     ;; The default is 800 kilobytes.  Measured in bytes.
     (setq gc-cons-threshold (* 50 1000 1000))

     ;; Profile emacs startup
     (add-hook 'emacs-startup-hook
               (lambda ()
                 (message "*** Emacs loaded in %s with %d garbage collections."
                          (format "%.2f seconds"
                                  (float-time
                                   (time-subtract after-init-time before-init-time)))
                          gcs-done)))
   #+end_src

** Native Compilation
   #+begin_src emacs-lisp
     ;; Silence compiler warnings as they can be pretty disruptive
     (setq comp-async-report-warnings-errors nil)
   #+end_src

