public/Emacs/DotFiles.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-03 Mon 02:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>用org-mode配置所有dotfile</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="kamisama" />
</head>
<body>
<div id="content">
<h1 class="title">用org-mode配置所有dotfile</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c94d45">1. 用org-babel配置所有的dotfile</a>
<ul>
<li><a href="#orgf4a45bd">1.1. Org-babel</a></li>
<li><a href="#orgfc8da0a">1.2. 将一个代码块的执行结果或返回值传递给另一个代码块</a></li>
<li><a href="#orgf2fa8f2">1.3. 每次保存这个文件自动执行 <code>org-bable-tangle</code></a></li>
</ul>
</li>
<li><a href="#org41cb6be">2. Emacs</a>
<ul>
<li><a href="#org73c8d1c">2.1. 显示emacs启动时间</a></li>
<li><a href="#org7a7b4a6">2.2. Native Compilation</a></li>
<li><a href="#orgc641fa8">2.3. 包管理工具</a></li>
<li><a href="#orge8dff8e">2.4. 默认编码格式</a></li>
<li><a href="#org61ae071">2.5. Server Mode</a></li>
<li><a href="#orgc52b369">2.6. 查看启动过程耗时</a></li>
<li><a href="#orgc27abdc">2.7. 基本的设置</a>
<ul>
<li><a href="#org3ac6023">2.7.1. 取消初始界面的菜单,工具栏,滚动条等</a></li>
<li><a href="#org8c0f133">2.7.2. 优化滚动的表现</a></li>
<li><a href="#org8862a08">2.7.3. 窗口透明度和最大化</a></li>
<li><a href="#org7fb81a6">2.7.4. 字体设置</a></li>
<li><a href="#org7bf150d">2.7.5. 状态栏设置</a>
<ul>
<li><a href="#orgf4aabd3">2.7.5.1. Basic Customization</a></li>
<li><a href="#orgb2a340b">2.7.5.2. Enable mode Diminishing</a></li>
<li><a href="#org348d6e8">2.7.5.3. Smart mode line</a></li>
<li><a href="#org18e88a0">2.7.5.4. Doom modeline</a></li>
</ul>
</li>
<li><a href="#org55c1d05">2.7.6. 更好的括号展示</a></li>
<li><a href="#org45f9362">2.7.7. doom主题</a></li>
<li><a href="#orga4abc3d">2.7.8. 行号设置</a></li>
<li><a href="#org7f8bd3e">2.7.9. Workspace</a></li>
<li><a href="#org207ffc2">2.7.10. NOtifications</a></li>
<li><a href="#org02ae3d8">2.7.11. Auto-Saving changed files</a></li>
<li><a href="#org33272af">2.7.12. Auto-Reverting Changed Files</a></li>
<li><a href="#org12d82b2">2.7.13. UI Toggles</a></li>
</ul>
</li>
<li><a href="#orgfa434d1">2.8. 按键设置</a>
<ul>
<li><a href="#org69abfe8">2.8.1. 查看使用了哪些命令</a></li>
<li><a href="#orgf5e8bc8">2.8.2. 取消ESC作为 <code>M-x</code> 的前缀按键,将其设置为和Vim类似的退出命令 <code>C-g</code></a></li>
<li><a href="#orgb043a8f">2.8.3. 取消 <code>C-u</code> 作为 <code>[count]</code> 的作用,因为要使用Vim的 <code>C-u</code> 做翻页</a></li>
<li><a href="#orgbcd830a">2.8.4. Evil</a>
<ul>
<li><a href="#org8b7ee9b">2.8.4.1. 基本的Vim按键设置</a></li>
<li><a href="#org7729f44">2.8.4.2. 绑定"jk"退出插入模式</a></li>
<li><a href="#orgcf10de2">2.8.4.3. 绑定&lt;leader&gt;s重新加载配置文件</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org23ed809">2.9. 编辑设置</a>
<ul>
<li><a href="#org57d8ecd">2.9.1. Tab Width</a></li>
<li><a href="#org6edd37e">2.9.2. Use spaces instead of tabs for indnetation</a></li>
<li><a href="#org6dcb679">2.9.3. Commenting Lines</a></li>
<li><a href="#orgdd7559d">2.9.4. Automatically Clean whitespace</a></li>
</ul>
</li>
<li><a href="#orge95bc58">2.10. 按键面板</a></li>
<li><a href="#orgf2a52ac">2.11. 按键绑定</a>
<ul>
<li><a href="#org1fc8144">2.11.1. general.el 用来管理快捷键绑定</a></li>
<li><a href="#orgfa0c767">2.11.2. hydra 来绑定快捷键</a></li>
<li><a href="#org0aa3e47">2.11.3. Evil 快捷键绑定</a></li>
</ul>
</li>
<li><a href="#org2c7a72d">2.12. 文件浏览器</a></li>
<li><a href="#org5ea226f">2.13. Minibuffer补全(Emacs 命令补全)</a></li>
<li><a href="#orgafd9251">2.14. Development</a>
<ul>
<li><a href="#orgda6de19">2.14.1. Lsp-mode</a>
<ul>
<li><a href="#orgcd3a72f">2.14.1.1. Lsp</a></li>
<li><a href="#org84e7a6d">2.14.1.2. Lsp for python</a></li>
<li><a href="#org2ab437b">2.14.1.3. LSP for Html</a></li>
</ul>
</li>
<li><a href="#orgff5a092">2.14.2. Python<sub>settings</sub></a></li>
<li><a href="#orgaf6bed4">2.14.3. Format python code</a></li>
<li><a href="#org7a0f70f">2.14.4. Format All</a></li>
<li><a href="#org55b4de7">2.14.5. Elpy &#x2013; IDE for py</a></li>
</ul>
</li>
<li><a href="#org4551ed8">2.15. Orgmode</a>
<ul>
<li><a href="#orgdf0b22e">2.15.1. CodeBlock模版</a></li>
<li><a href="#org1700710">2.15.2. outline</a></li>
<li><a href="#org8edd34e">2.15.3. Org-roam</a></li>
<li><a href="#org13d8c2d">2.15.4. Org-mode</a>
<ul>
<li><a href="#org7169e03">2.15.4.1. Init set up</a></li>
<li><a href="#org616d23c">2.15.4.2. Hide emphasis markers</a></li>
<li><a href="#org7b2f732">2.15.4.3. org-drill</a></li>
</ul>
</li>
<li><a href="#org9fab3a3">2.15.5. Pomodoro</a></li>
<li><a href="#orge6c5772">2.15.6. tracking habits</a></li>
<li><a href="#org7bd442f">2.15.7. Auto insert newline</a></li>
<li><a href="#orgc12f545">2.15.8. org-capture-template</a></li>
<li><a href="#org4b7ab19">2.15.9. Encrypt</a></li>
</ul>
</li>
<li><a href="#orgea6d7bf">2.16. Productivity</a>
<ul>
<li><a href="#orgbc5748b">2.16.1. 括号补全</a></li>
<li><a href="#org7872172">2.16.2. Snippet</a></li>
</ul>
</li>
<li><a href="#org4fa9757">2.17. Ebook</a></li>
<li><a href="#orga822144">2.18. Magit</a></li>
<li><a href="#orgd4d6cb1">2.19. Save Emacs Sessions</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org7c94d45" class="outline-2">
<h2 id="org7c94d45"><span class="section-number-2">1</span> 用org-babel配置所有的dotfile</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf4a45bd" class="outline-3">
<h3 id="orgf4a45bd"><span class="section-number-3">1.1</span> Org-babel</h3>
<div class="outline-text-3" id="text-1-1">
<p>
org-mode 可以执行代码块用的是org-babel的功能
<code>org-babel-tangle(C-c C-v t)</code> 是一个macs内置的方法,用来将org文件中的代码块写入到指定的文件中,理论上可以利用这个方法配置一切基于文本文件配置的软件
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(message "some text ")
</pre>
</div>

<blockquote>
<p>
要让这个org文件能起到配置作用:
</p>
<ul class="org-ul">
<li>头信息中配置好代码块tangle的目标文件</li>
<li>想对其他语言的代码块也生效需要配置 <code>org-babel-do-load-languages</code></li>
</ul>
</blockquote>

<p>
上面的例子里在代码块的 <code>:tangle</code> 属性中设置了目标文件的位置，如果代码块很多，总不能每一个都手动去指定吧，这里就可以用到org文件的头信息，
<code>#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el</code>,就像这个文件的头信息一样，将 emacs-lisp代码块的 <code>tangle</code> 属性设置为一个默认值，这个属性被所有 emacs-lisp 代码块继承.
和OB思想一样，如果代码块另外指定了目标文件的位置，那就会使用指定的，而不是头信息的默认属性.
</p>
</div>
</div>

<div id="outline-container-orgfc8da0a" class="outline-3">
<h3 id="orgfc8da0a"><span class="section-number-3">1.2</span> 将一个代码块的执行结果或返回值传递给另一个代码块</h3>
<div class="outline-text-3" id="text-1-2">
<p>
eamcs默认执行的只有emacs-lisp语言的代码块,开启其他语言的代码块执行功能需要添加配置:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (dot . t)
   (shell . t)
   ;; (browser . t)
   (js . t)
   ))
(push '("conf-unix" . conf-unix) org-src-lang-modes)
;; 每次执行不会询问是否执行
(setq org-confirm-babel-evaluate nil)
;;(message "hello")
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="orgf8874c0">import random
return random.randint(0,100)
</pre>
</div>
<p>
上面的代码块有名字 <code>block_name</code>,下面载配置文件的过程就是执行一系列emacs-lisp的过程,所以有时候顺序很重要
</p>
</div>
</div>

<div id="outline-container-orgf2fa8f2" class="outline-3">
<h3 id="orgf2fa8f2"><span class="section-number-3">1.3</span> 每次保存这个文件自动执行 <code>org-bable-tangle</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun efs/org-babel-tangle-config()
  (when (string-equal (buffer-file-name)
		      (expand-file-name "~/MyLife/Emacs/DotFiles.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))
(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org41cb6be" class="outline-2">
<h2 id="org41cb6be"><span class="section-number-2">2</span> Emacs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org73c8d1c" class="outline-3">
<h3 id="org73c8d1c"><span class="section-number-3">2.1</span> 显示emacs启动时间</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
	  (lambda ()
	    (message "*** Emacs loaded in %s with %d garbage collections."
		     (format "%.2f seconds"
			     (float-time
			      (time-subtract after-init-time before-init-time)))
		     gcs-done)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a7b4a6" class="outline-3">
<h3 id="org7a7b4a6"><span class="section-number-3">2.2</span> Native Compilation</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Silence compiler warnings as they can be pretty disruptive
(setq comp-async-report-warnings-errors nil)
</pre>
</div>
</div>
</div>
