Emacs/DotFiles.org
** 包管理工具
   #+begin_quote
   这是写给我自己记录用的,免得过些时候忘了写这个配置文件时候的这些想法,看到这里记得把这写碎碎念移到介绍emacs包管理工具或其他合适的地方.
   Emacs原生状态又丑由low,完全是上世纪的文本编辑器风格.那为啥会有那么多人用?还被成为是"神之编辑器"?我的使用感受是因为它有强大的社区支持和高度可定制.
   Vim也是可定制,但vimscript给我个人的感觉是真的难用,又像是语言又像是配置文件,但emacs不同,它的配置语言emacs-lisp是lisp方言,配置emacs感觉就像是
   在自己编写适合自己的编辑器的程序一样,怪不得之前看到一篇写lisp为什么现在不是热门语言的文章说lisp是一门创造其他编程语言的编程语言.基于这种强大的可定制能力,
   Emacs的社区成员为我们提供了许多强大的配置,这些配置被整合成一个个包放在Melpa,Elpa等仓库里,类似插件形式可供用户下载使用,Emacs自带的包管理工具我只用过图形界面的,也就是点点点来安装包,
   但用点点点的形式不能每次更换环境都靠点点点吧,看了下emacswiki,里面也有emacs自带的包管理工具的配置,好不好用不知道,反正我看的一些教程里都没用.网上emacs大神用的全是可再现的配置文件,跟着大神走总没错吧,在追求性价比这方面,搞编程(懒)的人总是有特殊的想法,
   大神的配置总是要达到一次配置,多次使用的目标.
   [[https://github.com/jwiegley/use-package][use-package]]就是一位大神因为使用的包太多创建出来的一个包管理工具,尽管大神说这个是用来更好的配置他那80多个包的而不是一个包管理工具,但也是能当包管理工具使的.
   我这个配置文件是跟着[[https://github.com/daviwil][David Wilson]]的系列直播视频和他的配置文件学的,尽管他的包管理工具已经换成 [[https://github.com/raxod502/straight.el#features][straight.el]] 了, 但暂时我还是先用着 =use-package= 再说,而且看介绍, =straight.el= 是有 =use-package= 集成的,将来再换应该不难,看David的配置文件也只加了一点额外配置,其他基本没怎么变.
   上面是不正经的碎碎念,下面就是正经的配置文件
   #+end_quote

   #+begin_src emacs-lisp
     ;; 这个package 就是emacs默认的包管理工具了(吧)
     (require 'package)   ;; 这里的require 就像是python里的import吧,package就像是module

     ;; 设置包仓库
     (setq package-archives '(("malpa" . "https://melpa.org/packages/")
                              ("org" . "https://orgmode.org/elpa/")
                              ("elpa" . "https://elpa.gnu.org/packages/")))

     ;; 设置完仓库后要初始化一下仓库,再去执行下载包或者其他动作,使用过linux包管理工具的应该不陌生
     (package-initialize)
     (unless package-archive-contents   ;;如果源头仓库的信息没有缓存到本地就执行package-refresh-contents缓存一下,相当与apt update吧
       (package-refresh-contents))
     ;; Initialize use-package on non-Linux platforms,这是在非linux平台上,可能use-package不是emacs内置的包,那就需要先下载才能使用
     (unless (package-installed-p 'use-package) ;;检测一下use-package是否安装了,没装就装一下呗
       (package-install 'use-package))

     ;; 到这里就可以开始使用 use-package 了
     (require 'use-package)
     ;; 默认加载每一个use-package管理的包,等于是每一个use-package里加上:ensure
     (setq use-package-always-ensure t)
   #+end_src
   
** 默认编码格式
   避免windows上可能会出现的编码错误
   #+begin_src emacs-lisp
     (set-default-coding-systems 'utf-8)
   #+end_src
** Server Mode
   #+begin_src emacs-lisp :tangle no
     (server-start)
   #+end_src
** 查看启动过程耗时
   #+begin_src emacs-lisp
     (use-package benchmark-init
       :ensure t
       :config
       ;; To disable collection of benchmark data after init is done.
       (add-hook 'after-init-hook 'benchmark-init/deactivate))
   #+end_src

** 基本的设置
*** 取消初始界面的菜单,工具栏,滚动条等 
    #+begin_src emacs-lisp
      (setq inhibit-startup-message t)
      (scroll-bar-mode 0)              ;Disable visible scrollbar
      (tool-bar-mode 0)                ;Disable the toolbar
      (tooltip-mode 0)                 ;Disable tooltips
      (set-fringe-mode 10)             ;Give some breathing room
      (menu-bar-mode 0)                ;Disale the menu bar
      ;;set up the visible bell
      (setq visible-bell t)
    #+end_src
    
*** 优化滚动的表现

    #+begin_src emacs-lisp
      (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
      (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
      (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
      (setq scroll-step 1) ;; keyboard scroll one line at a time
      (setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX
    #+end_src

*** 窗口透明度和最大化
    #+begin_src emacs-lisp
      (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
      (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
      (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
      (add-to-list 'default-frame-alist '(fullscreen . maximized))
    #+end_src

*** 字体设置

    #+begin_src emacs-lisp
      ;; 'han 的脚本类型对应CJK三种语言的字符 'latin 对应英文字符
      ;; (set-fontset-font "fontset-default" 'han "Xiaolai Mono SC")

      (set-fontset-font "fontset-default" 'han "AR PL UKai CN")
      ;; Ubuntu Mono 字体能很好的和中文1:2等宽,:font 属性的使用和.Xresource 里字体的使用方式一样,只不过不能指定多个字体
      (set-face-attribute 'default nil :font "Ubuntu Mono:pixelsize=20")
    #+end_src
    
*** 状态栏设置
**** Basic Customization

     #+begin_src emacs-lisp
       (setq display-time-format "%H:%M %p %Y-%m-%d %j"
             dispaly-time-default-load-average nil)
       ;;(setq display-time-format "%l:%M %p %b %y"
       ;;       dispaly-time-default-load-average nil)
     #+end_src

**** Enable mode Diminishing
     The diminish package hides pesky minor modes from the modelines.
     #+begin_src emacs-lisp
       (use-package diminish)
     #+end_src

**** Smart mode line
     #+begin_src emacs-lisp :tangle no
       (use-package smart-mode-line
         :disabled
         :if dw/is-termux
         :config
         (setq sml/no-confirm-load-theme t)
         (sml/setup)
         (sml/apply-theme 'respectful)  ; Respect the theme colors
         (setq sml/mode-width 'right
               sml/name-width 60)

         (setq-default mode-line-format
                       `("%e"
                         ,(when dw/exwm-enabled
                            '(:eval (format "[%d] " exwm-workspace-current-index)))
                         mode-line-front-space
                         evil-mode-line-tag
                         mode-line-mule-info
                         mode-line-client
                         mode-line-modified
                         mode-line-remote
                         mode-line-frame-identification
                         mode-line-buffer-identification
                         sml/pos-id-separator
                         (vc-mode vc-mode)
                         " "
                                               ;mode-line-position
                         sml/pre-modes-separator
                         mode-line-modes
                         " "
                         mode-line-misc-info))
         (setq rm-excluded-modes
               (mapconcat
                'identity
                                               ; These names must start with a space!
                '(" GitGutter" " MRev" " company"
                  " Helm" " Undo-Tree" " Projectile.*" " Z" " Ind"
                  " Org-Agenda.*" " ElDoc" " SP/s" " cider.*")
                "\\|")))
     #+end_src
