Emacs/DotFiles.org
**** Doom modeline
     #+begin_src emacs-lisp
       (use-package minions           ; 隐藏当前启用了哪些minor mode
         :hook (doom-modeline-mode . minions-mode))

       (use-package all-the-icons)    ; modeline 正常展示需要许多图标字体支持,字体需要从github下载安装

       (use-package doom-modeline

         :init
         (doom-modeline-mode 1)
         ;;:after eshell                ; 确保启动eshell后启动doom-modeline,尽管manjaro-i3上正使用的emacs不存在这个问题
         :custom-face
         (mode-line ((t (:height 0.85))))
         (mode-line-inactive ((t (:height 0.85))))
         :custom
         (doom-modeline-height 15)
         (doom-modeline-bar-width 6)
         (doom-modeline-lsp t)
         (doom-modeline-github nil)
         (doom-modeline-mu4e nil)
         (doom-modeline-irc nil)
         (doom-modeline-minor-modes t)
         (doom-modeline-persp-name nil)
         (doom-modeline-buffer-file-name-style 'truncate-except-project)
         (doom-modeline-major-mode-icon nil)
         )
     #+end_src

*** 更好的括号展示
    
    #+begin_src emacs-lisp
      ;; 按不同颜色显示成对括号
      (use-package rainbow-delimiters
        :hook (prog-mode . rainbow-delimiters-mode))
      ;;高亮当前光标下的括号对应的括号
      (use-package paren
        :config
        (set-face-attribute 'show-paren-match-expression nil :background "#FFFFFF")
        (show-paren-mode 1))

    #+end_src

*** doom主题

    #+begin_src emacs-lisp
      (use-package doom-themes
        :init
        (load-theme 'doom-palenight t)
        :config
        (doom-themes-visual-bell-config))
    #+end_src
    
*** 行号设置
    
    #+begin_src emacs-lisp

      (column-number-mode)
      ;; Disable line numbers for some modes
      (dolist (mode '(term-mode-hook
                      shell-mode-hook
                      eshell-mode-hook
                      markdown-mode-hook
                      org-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 0))))

      (dolist (mode '(text-mode-hook
                      prog-mode-hook
                      conf-mode-hook))
        (add-hook mode (lambda () (display-line-numbers-mode 1))))

    #+end_src
    
*** Workspace
    #+begin_src emacs-lisp
      (use-package perspective
        :demand t
        :bind (("C-M-k" . persp-switch)
               ("C-M-n" . persp-next)
               ("C-x k" . persp-kill-buffer*))
        :custom
        (persp-initial-frame-name "Main")
        :config
        ;; Running `persp-mode' multiple times resets the perspective list...
        (unless (equal persp-mode t)
          (persp-mode)))
    #+end_src
*** NOtifications
    #+begin_src emacs-lisp
      (use-package alert
        :commands alert
        :config
        (setq alert-default-style 'notifications))
    #+end_src
*** Auto-Saving changed files
    #+begin_src emacs-lisp
      (use-package super-save
        :defer 1
        :diminish super-save-mode
        :config
        (super-save-mode +1)
        (setq super-save-auto-save-when-idle t) )
    #+end_src
*** Auto-Reverting Changed Files
    #+begin_src emacs-lisp
      (setq global-auto-revert-non-file-buffers t)
      (global-auto-revert-mode 1)
    #+end_src
*** UI Toggles
    #+begin_src emacs-lisp
    #+end_src
** 按键设置

*** 查看使用了哪些命令
    #+begin_src emacs-lisp
      (use-package command-log-mode)
    #+end_src
   
*** 取消ESC作为 =M-x= 的前缀按键,将其设置为和Vim类似的退出命令 =C-g=
    #+begin_src emacs-lisp
      ;; Make ESC quit prompts
      (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

    #+end_src

*** 取消 =C-u= 作为 =[count]= 的作用,因为要使用Vim的 =C-u= 做翻页

    #+begin_src emacs-lisp
      (global-set-key (kbd "C-M-u") 'universal-argument)
    #+end_src


*** Evil

**** 基本的Vim按键设置
     #+begin_src emacs-lisp
       (use-package undo-tree
         :init
         (global-undo-tree-mode 1))

       (use-package evil
         :init
         (setq evil-want-integration t)
         (setq evil-want-keybinding nil)
         (setq evil-want-C-u-scroll t)
         (setq evil-want-C-i-jump nil)
         (setq evil-undo-system 'undo-tree)

         :config
         (evil-mode 1)
         (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
         (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

         ;; Use visual line motions even outside of visual-line-mode buffers
         ;;(evil-global-set-key 'motion "j" 'evil-next-visual-line)
         ;;(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

         (evil-set-initial-state 'messages-buffer-mode 'normal)
         (evil-set-initial-state 'dashboard-mode 'normal)
         ;;(evil-set-initial-state 'treemacs-mode 'evil-normal-state)
         )

       (use-package evil-collection
         :after evil
         :config
         (evil-collection-init))

     #+end_src


**** 绑定"jk"退出插入模式

     #+begin_src emacs-lisp

       (use-package evil-escape
         :config
         (evil-escape-mode 1)
         (setq-default evil-escape-key-sequence "jk")
         (setq-default evil-escape-delay 0.5))

     #+end_src


**** 绑定<leader>s重新加载配置文件
     #+begin_src emacs-lisp
       ;; (evil-set-leader 'normal (kbd "SPC"))
       ;; This buffer is for text that is not saved, and for Lisp evaluation.
       ;; To create a file, visit it with <open> and enter text in its buffer.

       (defun reload-init-file ()
         (interactive)
         (load-file "~/.emacs.d/init.el")
         )
       (evil-define-key 'normal 'global (kbd "<leader>s") 'reload-init-file)

     #+end_src
** 编辑设置
*** Tab Width
    #+begin_src emacs-lisp
      (setq-default tab-width 2)
      (setq-default evil-shift-width tab-width)
    #+end_src
*** Use spaces instead of tabs for indnetation
    #+begin_src emacs-lisp
      (setq-default indent-tabs-mode nil)
    #+end_src
*** Commenting Lines
    #+begin_src emacs-lisp
      (use-package evil-nerd-commenter
        :bind ("M-c" . evilnc-comment-or-uncomment-lines))
    #+end_src
