public/Emacs/DotFiles.html
<div id="outline-container-org18e88a0" class="outline-5">
<h5 id="org18e88a0"><span class="section-number-5">2.7.5.4</span> Doom modeline</h5>
<div class="outline-text-5" id="text-2-7-5-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package minions           ; 隐藏当前启用了哪些minor mode
  :hook (doom-modeline-mode . minions-mode))

(use-package all-the-icons)    ; modeline 正常展示需要许多图标字体支持,字体需要从github下载安装

(use-package doom-modeline

  :init
  (doom-modeline-mode 1)
  ;;:after eshell                ; 确保启动eshell后启动doom-modeline,尽管manjaro-i3上正使用的emacs不存在这个问题
  :custom-face
  (mode-line ((t (:height 0.85))))
  (mode-line-inactive ((t (:height 0.85))))
  :custom
  (doom-modeline-height 15)
  (doom-modeline-bar-width 6)
  (doom-modeline-lsp t)
  (doom-modeline-github nil)
  (doom-modeline-mu4e nil)
  (doom-modeline-irc nil)
  (doom-modeline-minor-modes t)
  (doom-modeline-persp-name nil)
  (doom-modeline-buffer-file-name-style 'truncate-except-project)
  (doom-modeline-major-mode-icon nil)
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org55c1d05" class="outline-4">
<h4 id="org55c1d05"><span class="section-number-4">2.7.6</span> 更好的括号展示</h4>
<div class="outline-text-4" id="text-2-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; 按不同颜色显示成对括号
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
;;高亮当前光标下的括号对应的括号
(use-package paren
  :config
  (set-face-attribute 'show-paren-match-expression nil :background "#FFFFFF")
  (show-paren-mode 1))

</pre>
</div>
</div>
</div>

<div id="outline-container-org45f9362" class="outline-4">
<h4 id="org45f9362"><span class="section-number-4">2.7.7</span> doom主题</h4>
<div class="outline-text-4" id="text-2-7-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-themes
  :init
  (load-theme 'doom-palenight t)
  :config
  (doom-themes-visual-bell-config))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4abc3d" class="outline-4">
<h4 id="orga4abc3d"><span class="section-number-4">2.7.8</span> 行号设置</h4>
<div class="outline-text-4" id="text-2-7-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(column-number-mode)
;; Disable line numbers for some modes
(dolist (mode '(term-mode-hook
		shell-mode-hook
		eshell-mode-hook
		markdown-mode-hook
		org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(dolist (mode '(text-mode-hook
		prog-mode-hook
		conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

</pre>
</div>
</div>
</div>

<div id="outline-container-org7f8bd3e" class="outline-4">
<h4 id="org7f8bd3e"><span class="section-number-4">2.7.9</span> Workspace</h4>
<div class="outline-text-4" id="text-2-7-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package perspective
  :demand t
  :bind (("C-M-k" . persp-switch)
	 ("C-M-n" . persp-next)
	 ("C-x k" . persp-kill-buffer*))
  :custom
  (persp-initial-frame-name "Main")
  :config
  ;; Running `persp-mode' multiple times resets the perspective list...
  (unless (equal persp-mode t)
    (persp-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org207ffc2" class="outline-4">
<h4 id="org207ffc2"><span class="section-number-4">2.7.10</span> NOtifications</h4>
<div class="outline-text-4" id="text-2-7-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package alert
  :commands alert
  :config
  (setq alert-default-style 'notifications))
</pre>
</div>
</div>
</div>
<div id="outline-container-org02ae3d8" class="outline-4">
<h4 id="org02ae3d8"><span class="section-number-4">2.7.11</span> Auto-Saving changed files</h4>
<div class="outline-text-4" id="text-2-7-11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package super-save
  :defer 1
  :diminish super-save-mode
  :config
  (super-save-mode +1)
  (setq super-save-auto-save-when-idle t) )
</pre>
</div>
</div>
</div>
<div id="outline-container-org33272af" class="outline-4">
<h4 id="org33272af"><span class="section-number-4">2.7.12</span> Auto-Reverting Changed Files</h4>
<div class="outline-text-4" id="text-2-7-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq global-auto-revert-non-file-buffers t)
(global-auto-revert-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org12d82b2" class="outline-4">
<h4 id="org12d82b2"><span class="section-number-4">2.7.13</span> UI Toggles</h4>
<div class="outline-text-4" id="text-2-7-13">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfa434d1" class="outline-3">
<h3 id="orgfa434d1"><span class="section-number-3">2.8</span> 按键设置</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org69abfe8" class="outline-4">
<h4 id="org69abfe8"><span class="section-number-4">2.8.1</span> 查看使用了哪些命令</h4>
<div class="outline-text-4" id="text-2-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package command-log-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf5e8bc8" class="outline-4">
<h4 id="orgf5e8bc8"><span class="section-number-4">2.8.2</span> 取消ESC作为 <code>M-x</code> 的前缀按键,将其设置为和Vim类似的退出命令 <code>C-g</code></h4>
<div class="outline-text-4" id="text-2-8-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; Make ESC quit prompts
(global-set-key (kbd "&lt;escape&gt;") 'keyboard-escape-quit)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb043a8f" class="outline-4">
<h4 id="orgb043a8f"><span class="section-number-4">2.8.3</span> 取消 <code>C-u</code> 作为 <code>[count]</code> 的作用,因为要使用Vim的 <code>C-u</code> 做翻页</h4>
<div class="outline-text-4" id="text-2-8-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd "C-M-u") 'universal-argument)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgbcd830a" class="outline-4">
<h4 id="orgbcd830a"><span class="section-number-4">2.8.4</span> Evil</h4>
<div class="outline-text-4" id="text-2-8-4">
</div>
<div id="outline-container-org8b7ee9b" class="outline-5">
<h5 id="org8b7ee9b"><span class="section-number-5">2.8.4.1</span> 基本的Vim按键设置</h5>
<div class="outline-text-5" id="text-2-8-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-undo-system 'undo-tree)

  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  ;;(evil-global-set-key 'motion "j" 'evil-next-visual-line)
  ;;(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  ;;(evil-set-initial-state 'treemacs-mode 'evil-normal-state)
  )

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

</pre>
</div>
</div>
</div>


<div id="outline-container-org7729f44" class="outline-5">
<h5 id="org7729f44"><span class="section-number-5">2.8.4.2</span> 绑定"jk"退出插入模式</h5>
<div class="outline-text-5" id="text-2-8-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package evil-escape
  :config
  (evil-escape-mode 1)
  (setq-default evil-escape-key-sequence "jk")
  (setq-default evil-escape-delay 0.5))

</pre>
</div>
</div>
</div>


<div id="outline-container-orgcf10de2" class="outline-5">
<h5 id="orgcf10de2"><span class="section-number-5">2.8.4.3</span> 绑定&lt;leader&gt;s重新加载配置文件</h5>
<div class="outline-text-5" id="text-2-8-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; (evil-set-leader 'normal (kbd "SPC"))
;; This buffer is for text that is not saved, and for Lisp evaluation.
;; To create a file, visit it with &lt;open&gt; and enter text in its buffer.

(defun reload-init-file ()
  (interactive)
  (load-file "~/.emacs.d/init.el")
  )
(evil-define-key 'normal 'global (kbd "&lt;leader&gt;s") 'reload-init-file)

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org23ed809" class="outline-3">
<h3 id="org23ed809"><span class="section-number-3">2.9</span> 编辑设置</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-org57d8ecd" class="outline-4">
<h4 id="org57d8ecd"><span class="section-number-4">2.9.1</span> Tab Width</h4>
<div class="outline-text-4" id="text-2-9-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-default tab-width 2)
(setq-default evil-shift-width tab-width)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6edd37e" class="outline-4">
<h4 id="org6edd37e"><span class="section-number-4">2.9.2</span> Use spaces instead of tabs for indnetation</h4>
<div class="outline-text-4" id="text-2-9-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq-default indent-tabs-mode nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6dcb679" class="outline-4">
<h4 id="org6dcb679"><span class="section-number-4">2.9.3</span> Commenting Lines</h4>
<div class="outline-text-4" id="text-2-9-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-nerd-commenter
  :bind ("M-c" . evilnc-comment-or-uncomment-lines))
</pre>
</div>
</div>
</div>
