Emacs/DotFiles.org
*** Automatically Clean whitespace
    #+begin_src emacs-lisp
      (use-package ws-butler
        :hook ((text-mode . ws-butler-mode)
               (prog-mode . ws-butler-mode)))

    #+end_src

** 按键面板
   [[https://github.com/justbur/emacs-which-key][which-key]] 根据当前按下的按键展示可用(能)的快捷键组合和对应命令
   #+begin_src emacs-lisp

     (use-package which-key
       :init (which-key-mode)
       :diminish which-key-mode
       :config
       (setq which-key-idle-delay 0.3)) ;设置多少延迟后调用which-key

   #+end_src

** 按键绑定
   
*** [[https://github.com/noctuid/general.el][general.el]] 用来管理快捷键绑定

    #+begin_src emacs-lisp :tangle no
      (use-package general
        :config
        (general-evil-setup t)
        (general-create-definer rune/leader-keys
                                :keymaps '(normal insert visual emacs)
                                :prefix "SPC"
                                :global-prefix "C-SPC")

        (rune/leader-keys
         "t"  '(:ignore t :which-key "toggles")
         "tt" '(counsel-load-theme :which-key "choose theme")
         "f"  '(:ignore t :which-key "file")
         "ft" '(treemacs :which-key "file tree")))

    #+end_src

*** hydra 来绑定快捷键
    
    #+begin_src emacs-lisp :tangle no
      (use-package general
        :config
        (general-create-definer rune/leader-keys
                                :keymaps '(normal insert visual emacs)
                                :prefix "SPC"
                                :global-prefix "C-SPC"))


      (defhydra hydra-files ()
        ;;(interactive)
        ;;("f" treemacs "file tree")

        ("t" treemacs :which-key "file tre")
        ("l" text-scale-increase "out"))
      (defhydra hydra-leader ()
        ("f" hydra-files/body "files" :exit t))

      (rune/leader-keys
       "f" '(hydra-files/body :which-key "files")
       )

      ;;(global-set-key (kbd "SPC") 'hydra-leader/body)
      ;;     (define-key evil-normal-state-map (kbd "SPC") 'hydra-leader/body)
      (defhydra hydra-zoom ()
        "zoom"
        ("g" text-scale-increase "in")
        ("l" text-scale-decrease "out"))

      (global-set-key (kbd "C-c") 'hydra-zoom/body)

    #+end_src

*** Evil 快捷键绑定
    #+begin_src emacs-lisp


      ;;(add-hook 'special-mode-hook 'evil-normal-state)
      (define-key evil-normal-state-map (kbd "<SPC>ft") '("File tree" . treemacs))
      (which-key-add-key-based-replacements
        "<SPC>f" "Files")
      ;;(define-key evil-normal-state-map (kbd "<SPC>ft")'("File tree" . treemacs))
    #+end_src

** 文件浏览器
   #+begin_src emacs-lisp
     (use-package treemacs
       :ensure t
       :defer t)
     (use-package treemacs-evil
       :after (treemacs evil)
       :ensure t)
   #+end_src
   
** Minibuffer补全(Emacs 命令补全)
   Emacs有两种类型的补全，一种是写代码或文本时的补全(text completion),另一种就是使用emacs 命令时的补全(Minibuffer completion).
   [[https://github.com/kenmcmil/ivy][Ivy]] 是一个使用minibuffer的补全机制,提供针对emacs命令的各种补全功能,[[https://github.com/abo-abo/swiper][swpier]] 是基于Ivy的更好用的 =Isearch= 工具, [[https://github.com/abo-abo/swiper#counsel][counsel]] 是基于Ivy的 =execute-extended-command= (M-x) 增强版本,用正则更方便的选择emacs命令

   #+begin_src emacs-lisp
     (use-package ivy
       :diminish
       :bind (("C-s" . swiper)
              :map ivy-minibuffer-map
              ("TAB" . ivy-alt-done)
              ("C-l" . ivy-alt-done)
              ("C-j" . ivy-next-line)
              ("C-k" . ivy-previous-line)
              :map ivy-switch-buffer-map
              ("C-k" . ivy-previous-line)
              ("C-l" . ivy-done)
              ("C-d" . ivy-switch-buffer-kill)
              :map ivy-reverse-i-search-map
              ("C-k" . ivy-previous-line)
              ("C-d" . ivy-reverse-i-search-kill))
       :config
       (ivy-mode 1))

     (use-package ivy-rich
       :init
       (ivy-rich-mode 1))

     (use-package counsel
       :bind (("M-x" . counsel-M-x)
              ("C-x b" . counsel-ibuffer)
              ("C-x C-f" . counsel-find-file)
              :map minibuffer-local-map
              ("C-r" . 'counsel-minibuffer-history)))
   #+end_src

** Development
*** Lsp-mode
**** Lsp
    
     #+begin_src emacs-lisp


       (use-package lsp-mode
         :init
         ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
         (setq lsp-keymap-prefix "C-c l")
         :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
                (python-mode . lsp)
                (json-mode .lsp)
                (html-mode .lsp)
                ;; if you want which-key integration
                (lsp-mode . lsp-enable-which-key-integration))
         :commands lsp lsp-deferred)

       ;; optionally

       ;; company provide completion function
       (use-package company)

       (use-package flycheck
         ;; :init (global-flycheck-mode)
         )

       (use-package lsp-ui :commands lsp-ui-mode)
       ;; if you are helm user
       ;;(use-package helm-lsp :commands helm-lsp-workspace-symbol)
       ;; if you are ivy user
       (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
       (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

       ;; optionally if you want to use debugger
       ;; (use-package dap-mode
         ;; :defer)

       ;; (use-package dap-LANGUAGE) to load the dap adapter for your language
       ;; (require 'dap-python)

       ;; optional if you want which-key integration
       ;;(use-package which-key
       ;;:config
       ;;(which-key-mode))

     #+end_src

     #+begin_src emacs-lisp :tangle no
       (use-package lsp-mode
         :init
         ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
         (setq lsp-keymap-prefix "C-c l")
         :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
                (python-mode . lsp-defer)
                ;; if you want which-key integration
                (lsp-mode . lsp-enable-which-key-integration))
         :commands lsp)

       ;; optionally
       (use-package lsp-ui :commands lsp-ui-mode)
       ;; if you are helm user
       ;;(use-package helm-lsp :commands helm-lsp-workspace-symbol)
       ;; if you are ivy user
       (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
       (use-package lsp-treemacs :commands lsp-treemacs-errors-list)

       ;; optionally if you want to use debugger
       (use-package dap-mode)
       ;; (use-package dap-LANGUAGE) to load the dap adapter for your language

       ;; optional if you want which-key integration
       ;;(use-package which-key
       ;;:config
       ;;(which-key-mode))
     #+end_src
    
**** Lsp for python
     

***** Pylsp
      #+begin_src emacs-lisp :tangle no
        (setq lsp-pylsp-plugins-yapf-enabled t)
        (setq lsp-pylsp-plugins-jedi-use-pyenv-environment t)
      #+end_src
***** Pyright

      #+begin_src emacs-lisp :tangle no
        (use-package lsp-pyright
          :ensure t
          :hook (python-mode . (lambda ()
                                 (require 'lsp-pyright)
                                 (lsp))))  ; or lsp-deferred
        ;; (use-package company)
      #+end_src
