public/Emacs/DotFiles.html
<div id="outline-container-orgdd7559d" class="outline-4">
<h4 id="orgdd7559d"><span class="section-number-4">2.9.4</span> Automatically Clean whitespace</h4>
<div class="outline-text-4" id="text-2-9-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ws-butler
  :hook ((text-mode . ws-butler-mode)
	 (prog-mode . ws-butler-mode)))

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge95bc58" class="outline-3">
<h3 id="orge95bc58"><span class="section-number-3">2.10</span> 按键面板</h3>
<div class="outline-text-3" id="text-2-10">
<p>
<a href="https://github.com/justbur/emacs-which-key">which-key</a> 根据当前按下的按键展示可用(能)的快捷键组合和对应命令
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3)) ;设置多少延迟后调用which-key

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf2a52ac" class="outline-3">
<h3 id="orgf2a52ac"><span class="section-number-3">2.11</span> 按键绑定</h3>
<div class="outline-text-3" id="text-2-11">
</div>
<div id="outline-container-org1fc8144" class="outline-4">
<h4 id="org1fc8144"><span class="section-number-4">2.11.1</span> <a href="https://github.com/noctuid/general.el">general.el</a> 用来管理快捷键绑定</h4>
<div class="outline-text-4" id="text-2-11-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package general
  :config
  (general-evil-setup t)
  (general-create-definer rune/leader-keys
			  :keymaps '(normal insert visual emacs)
			  :prefix "SPC"
			  :global-prefix "C-SPC")

  (rune/leader-keys
   "t"  '(:ignore t :which-key "toggles")
   "tt" '(counsel-load-theme :which-key "choose theme")
   "f"  '(:ignore t :which-key "file")
   "ft" '(treemacs :which-key "file tree")))

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa0c767" class="outline-4">
<h4 id="orgfa0c767"><span class="section-number-4">2.11.2</span> hydra 来绑定快捷键</h4>
<div class="outline-text-4" id="text-2-11-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package general
  :config
  (general-create-definer rune/leader-keys
			  :keymaps '(normal insert visual emacs)
			  :prefix "SPC"
			  :global-prefix "C-SPC"))


(defhydra hydra-files ()
  ;;(interactive)
  ;;("f" treemacs "file tree")

  ("t" treemacs :which-key "file tre")
  ("l" text-scale-increase "out"))
(defhydra hydra-leader ()
  ("f" hydra-files/body "files" :exit t))

(rune/leader-keys
 "f" '(hydra-files/body :which-key "files")
 )

;;(global-set-key (kbd "SPC") 'hydra-leader/body)
;;     (define-key evil-normal-state-map (kbd "SPC") 'hydra-leader/body)
(defhydra hydra-zoom ()
  "zoom"
  ("g" text-scale-increase "in")
  ("l" text-scale-decrease "out"))

(global-set-key (kbd "C-c") 'hydra-zoom/body)

</pre>
</div>
</div>
</div>

<div id="outline-container-org0aa3e47" class="outline-4">
<h4 id="org0aa3e47"><span class="section-number-4">2.11.3</span> Evil 快捷键绑定</h4>
<div class="outline-text-4" id="text-2-11-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

;;(add-hook 'special-mode-hook 'evil-normal-state)
(define-key evil-normal-state-map (kbd "&lt;SPC&gt;ft") '("File tree" . treemacs))
(which-key-add-key-based-replacements
  "&lt;SPC&gt;f" "Files")
;;(define-key evil-normal-state-map (kbd "&lt;SPC&gt;ft")'("File tree" . treemacs))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2c7a72d" class="outline-3">
<h3 id="org2c7a72d"><span class="section-number-3">2.12</span> 文件浏览器</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package treemacs
  :ensure t
  :defer t)
(use-package treemacs-evil
  :after (treemacs evil)
  :ensure t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ea226f" class="outline-3">
<h3 id="org5ea226f"><span class="section-number-3">2.13</span> Minibuffer补全(Emacs 命令补全)</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Emacs有两种类型的补全，一种是写代码或文本时的补全(text completion),另一种就是使用emacs 命令时的补全(Minibuffer completion).
<a href="https://github.com/kenmcmil/ivy">Ivy</a> 是一个使用minibuffer的补全机制,提供针对emacs命令的各种补全功能,<a href="https://github.com/abo-abo/swiper">swpier</a> 是基于Ivy的更好用的 <code>Isearch</code> 工具, <a href="https://github.com/abo-abo/swiper#counsel">counsel</a> 是基于Ivy的 <code>execute-extended-command</code> (M-x) 增强版本,用正则更方便的选择emacs命令
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 :map ivy-switch-buffer-map
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafd9251" class="outline-3">
<h3 id="orgafd9251"><span class="section-number-3">2.14</span> Development</h3>
<div class="outline-text-3" id="text-2-14">
</div>
<div id="outline-container-orgda6de19" class="outline-4">
<h4 id="orgda6de19"><span class="section-number-4">2.14.1</span> Lsp-mode</h4>
<div class="outline-text-4" id="text-2-14-1">
</div>
<div id="outline-container-orgcd3a72f" class="outline-5">
<h5 id="orgcd3a72f"><span class="section-number-5">2.14.1.1</span> Lsp</h5>
<div class="outline-text-5" id="text-2-14-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">

(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
	 (python-mode . lsp)
	 (json-mode .lsp)
	 (html-mode .lsp)
	 ;; if you want which-key integration
	 (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp lsp-deferred)

;; optionally

;; company provide completion function
(use-package company)

(use-package flycheck
  ;; :init (global-flycheck-mode)
  )

(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
;;(use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
;; (use-package dap-mode
  ;; :defer)

;; (use-package dap-LANGUAGE) to load the dap adapter for your language
;; (require 'dap-python)

;; optional if you want which-key integration
;;(use-package which-key
;;:config
;;(which-key-mode))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
	 (python-mode . lsp-defer)
	 ;; if you want which-key integration
	 (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
;;(use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
(use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

;; optional if you want which-key integration
;;(use-package which-key
;;:config
;;(which-key-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org84e7a6d" class="outline-5">
<h5 id="org84e7a6d"><span class="section-number-5">2.14.1.2</span> Lsp for python</h5>
<div class="outline-text-5" id="text-2-14-1-2">
</div>
<ol class="org-ol">
<li><a id="org07d8ae0"></a>Pylsp<br />
<div class="outline-text-6" id="text-2-14-1-2-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq lsp-pylsp-plugins-yapf-enabled t)
(setq lsp-pylsp-plugins-jedi-use-pyenv-environment t)
</pre>
</div>
</div>
</li>
<li><a id="orga945cae"></a>Pyright<br />
<div class="outline-text-6" id="text-2-14-1-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
			 (require 'lsp-pyright)
			 (lsp))))  ; or lsp-deferred
;; (use-package company)
</pre>
</div>
</div>
</li>
