Emacs/DotFiles.org
***** Mspyls
      #+begin_src emacs-lisp :tangle no
        (use-package lsp-python-ms
          :ensure t
          :init (setq lsp-python-ms-auto-install-server t)
          :hook (python-mode . (lambda ()
                                 (require 'lsp-python-ms)
                                 (lsp))))  ;lsp or lsp-deferred

      #+end_src
***** jedi
      #+begin_src emacs-lisp :tangle no
        (use-package lsp-jedi
          :ensure t
          :config
          (with-eval-after-load "lsp-mode"
            (add-to-list 'lsp-disabled-clients 'pyls)
            (add-to-list 'lsp-disabled-clients 'mspyls)
            (add-to-list 'lsp-disabled-clients 'pylsp)
            ;; (add-to-list 'lsp-enabled-clients 'jedi)
            ))
      #+end_src

**** LSP for Html
     #+begin_src emacs-lisp

     #+end_src

*** Python_settings
    #+begin_src emacs-lisp
      ;; 设置缩进为4
      (setq
       python-indent-offset 4
       python-indent-guess-indent-offset nil)
      (add-hook 'python-mode-hook (electric-pair-mode 1))
    #+end_src

*** Format python code
    #+begin_src emacs-lisp
      (use-package yapfify
        :config
        (add-hook 'python-mode-hook 'yapf-mode))
    #+end_src

*** Format All
    #+begin_src emacs-lisp
      (use-package format-all)
    #+end_src
*** Elpy -- IDE for py
    #+begin_src emacs-lisp :tangle no
      (use-package elpy
        :ensure t
        :init
        (elpy-enable))
    #+end_src

** Orgmode

   
*** CodeBlock模版
    #+begin_src emacs-lisp
      (require 'org-tempo)
      (add-to-list 'org-structure-template-alist '("py" . "src python :results output"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("ipy" . "src ipython :session"))
      (add-to-list 'org-structure-template-alist '("bash" . "src bash"))
      #+end_src

*** outline
    配置headline的项目符号(bullet point)
    #+begin_src emacs-lisp 
      (use-package org-superstar
        :after org
        :hook (org-mode . org-superstar-mode)
        :config
        (setq org-superstar-leading-bullet  ?\s)

        :custom
        ;;(org-superstar-remove-leading-stars t)

        (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
        ;; (org-superstar-headline-bullets-list '("☯" "☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷"))
        )


    #+end_src

    配置折叠后的省略号
    #+begin_src emacs-lisp 
      (setq org-ellipsis " ▼ ")
    #+end_src
    
*** Org-roam
    #+begin_src emacs-lisp
            ;;(use-package org-roam
              ;;:ensure t
              ;;:init
              ;;(setq org-roam-v2-ack t)
              ;;:custom
              ;;(org-roam-directory "~/MyLife/org-roam")
              ;;:bind (("C-c n l" . org-roam-buffer-toggle)
                     ;;("C-c n f" . org-roam-node-find)
                     ;;("C-c n i" . org-roam-node-insert))
              ;;:config
              ;;(org-roam-setup))
      (use-package org-roam
        :ensure t
        :init
        (setq org-roam-v2-ack t)
        :custom
        (org-roam-directory "~/MyLife/org-roam")
        (org-roam-completion-everywhere t)
        (org-roam-dailies-capture-templates
          '(("d" "default" entry "* %<%I:%M %p>: %?"
             :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
        :bind (("C-c n l" . org-roam-buffer-toggle)
               ("C-c n f" . org-roam-node-find)
               ("C-c n i" . org-roam-node-insert)
               :map org-mode-map
               ("C-M-i" . completion-at-point)
               :map org-roam-dailies-map
               ("Y" . org-roam-dailies-capture-yesterday)
               ("T" . org-roam-dailies-capture-tomorrow))
        :bind-keymap
        ("C-c n d" . org-roam-dailies-map)
        :config
        (require 'org-roam-dailies) ;; Ensure the keymap is available
        (org-roam-db-autosync-mode))

    #+end_src
*** Org-mode

**** Init set up

    #+begin_src emacs-lisp
      (setq org-directory "~/MyLife/org")
      (global-set-key (kbd "C-c l") 'org-store-link)
      (global-set-key (kbd "C-c a") 'org-agenda)
      (global-set-key (kbd "C-c c") 'org-capture)
    #+end_src
    
**** Hide emphasis markers

     #+begin_src emacs-lisp
       (setq org-hide-emphasis-markers t)
     #+end_src

**** org-drill
     #+begin_src emacs-lisp
       (use-package org-drill)
     #+end_src

*** Pomodoro
    #+begin_src emacs-lisp :tangle no
      (use-package org-pomodoro
        :config
        (setq org-pomodoro-start-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
        (setq org-pomodoro-short-break-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
        (setq org-pomodoro-long-break-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
        (setq org-pomodoro-finished-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav")))
      ;; org-pomodoro use sound-wav pavkage to play the sound
      (use-package sound-wav)

    #+end_src

*** tracking habits
    #+begin_src emacs-lisp
      (add-to-list 'org-modules 'org-habit)
    #+end_src

*** Auto insert newline
    #+begin_src emacs-lisp
      (add-hook 'org-mode-hook '(lambda () (setq fill-column 80)))
      (add-hook 'org-mode-hook 'auto-fill-mode)
    #+end_src

*** org-capture-template
    #+begin_src emacs-lisp
      (setq org-capture-templates
      '(
        ("t" "Tasks")
        ("tt" "TODO" entry (file+headline "GTD.org" "Tasks") "* TODO %?\n %i\n %a")
        ("T" "Thoughts")
        ("TT" "Thought  To be done" entry (file+headline "GTD.org" "未实现的想法") "* %?\n" :jump-to-captured t)
        ("d" "Drills")
        ("dE" "Drills for English" entry (file+headline "GTD.org" "English")  "* %? :drill:")
        ("dP" "Drills for Python" entry (file+headline "~/MyLife/Python/Learning_Python/README.org" "练习题") "* %? :drill:\n** Answer\n** Note\n" :jump-to-captured t)
        )
      )
    #+end_src

*** Encrypt
    #+begin_src emacs-lisp
      (require 'org-crypt)
      (org-crypt-use-before-save-magic)
      (setq org-tags-exclude-from-inheritance (quote ("crypt")))
      ;; GPG key to use for encryption
      ;; Either the Key ID or set to nil to use symmetric encryption.
      (setq org-crypt-key "kamisama")
    #+end_src



** Productivity
   一些能提高编辑效率的配置
   
