public/Emacs/DotFiles.html
<li><a id="orgcceea4b"></a>Mspyls<br />
<div class="outline-text-6" id="text-2-14-1-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-python-ms
  :ensure t
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
			 (require 'lsp-python-ms)
			 (lsp))))  ;lsp or lsp-deferred

</pre>
</div>
</div>
</li>
<li><a id="org13ba555"></a>jedi<br />
<div class="outline-text-6" id="text-2-14-1-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package lsp-jedi
  :ensure t
  :config
  (with-eval-after-load "lsp-mode"
    (add-to-list 'lsp-disabled-clients 'pyls)
    (add-to-list 'lsp-disabled-clients 'mspyls)
    (add-to-list 'lsp-disabled-clients 'pylsp)
    ;; (add-to-list 'lsp-enabled-clients 'jedi)
    ))
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2ab437b" class="outline-5">
<h5 id="org2ab437b"><span class="section-number-5">2.14.1.3</span> LSP for Html</h5>
<div class="outline-text-5" id="text-2-14-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgff5a092" class="outline-4">
<h4 id="orgff5a092"><span class="section-number-4">2.14.2</span> Python<sub>settings</sub></h4>
<div class="outline-text-4" id="text-2-14-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">;; 设置缩进为4
(setq
 python-indent-offset 4
 python-indent-guess-indent-offset nil)
(add-hook 'python-mode-hook (electric-pair-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf6bed4" class="outline-4">
<h4 id="orgaf6bed4"><span class="section-number-4">2.14.3</span> Format python code</h4>
<div class="outline-text-4" id="text-2-14-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package yapfify
  :config
  (add-hook 'python-mode-hook 'yapf-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a0f70f" class="outline-4">
<h4 id="org7a0f70f"><span class="section-number-4">2.14.4</span> Format All</h4>
<div class="outline-text-4" id="text-2-14-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package format-all)
</pre>
</div>
</div>
</div>
<div id="outline-container-org55b4de7" class="outline-4">
<h4 id="org55b4de7"><span class="section-number-4">2.14.5</span> Elpy &#x2013; IDE for py</h4>
<div class="outline-text-4" id="text-2-14-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package elpy
  :ensure t
  :init
  (elpy-enable))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4551ed8" class="outline-3">
<h3 id="org4551ed8"><span class="section-number-3">2.15</span> Orgmode</h3>
<div class="outline-text-3" id="text-2-15">
</div>
<div id="outline-container-orgdf0b22e" class="outline-4">
<h4 id="orgdf0b22e"><span class="section-number-4">2.15.1</span> CodeBlock模版</h4>
<div class="outline-text-4" id="text-2-15-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("py" . "src python :results output"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("ipy" . "src ipython :session"))
(add-to-list 'org-structure-template-alist '("bash" . "src bash"))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1700710" class="outline-4">
<h4 id="org1700710"><span class="section-number-4">2.15.2</span> outline</h4>
<div class="outline-text-4" id="text-2-15-2">
<p>
配置headline的项目符号(bullet point)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-leading-bullet  ?\s)

  :custom
  ;;(org-superstar-remove-leading-stars t)

  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
  ;; (org-superstar-headline-bullets-list '("☯" "☰" "☱" "☲" "☳" "☴" "☵" "☶" "☷"))
  )


</pre>
</div>

<p>
配置折叠后的省略号
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-ellipsis " ▼ ")
</pre>
</div>
</div>
</div>

<div id="outline-container-org8edd34e" class="outline-4">
<h4 id="org8edd34e"><span class="section-number-4">2.15.3</span> Org-roam</h4>
<div class="outline-text-4" id="text-2-15-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">      ;;(use-package org-roam
	;;:ensure t
	;;:init
	;;(setq org-roam-v2-ack t)
	;;:custom
	;;(org-roam-directory "~/MyLife/org-roam")
	;;:bind (("C-c n l" . org-roam-buffer-toggle)
	       ;;("C-c n f" . org-roam-node-find)
	       ;;("C-c n i" . org-roam-node-insert))
	;;:config
	;;(org-roam-setup))
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/MyLife/org-roam")
  (org-roam-completion-everywhere t)
  (org-roam-dailies-capture-templates
    '(("d" "default" entry "* %&lt;%I:%M %p&gt;: %?"
       :if-new (file+head "%&lt;%Y-%m-%d&gt;.org" "#+title: %&lt;%Y-%m-%d&gt;\n"))))
  :bind (("C-c n l" . org-roam-buffer-toggle)
	 ("C-c n f" . org-roam-node-find)
	 ("C-c n i" . org-roam-node-insert)
	 :map org-mode-map
	 ("C-M-i" . completion-at-point)
	 :map org-roam-dailies-map
	 ("Y" . org-roam-dailies-capture-yesterday)
	 ("T" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
  :config
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode))

</pre>
</div>
</div>
</div>
<div id="outline-container-org13d8c2d" class="outline-4">
<h4 id="org13d8c2d"><span class="section-number-4">2.15.4</span> Org-mode</h4>
<div class="outline-text-4" id="text-2-15-4">
</div>
<div id="outline-container-org7169e03" class="outline-5">
<h5 id="org7169e03"><span class="section-number-5">2.15.4.1</span> Init set up</h5>
<div class="outline-text-5" id="text-2-15-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-directory "~/MyLife/org")
(global-set-key (kbd "C-c l") 'org-store-link)
(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key (kbd "C-c c") 'org-capture)
</pre>
</div>
</div>
</div>

<div id="outline-container-org616d23c" class="outline-5">
<h5 id="org616d23c"><span class="section-number-5">2.15.4.2</span> Hide emphasis markers</h5>
<div class="outline-text-5" id="text-2-15-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-hide-emphasis-markers t)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b2f732" class="outline-5">
<h5 id="org7b2f732"><span class="section-number-5">2.15.4.3</span> org-drill</h5>
<div class="outline-text-5" id="text-2-15-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-drill)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9fab3a3" class="outline-4">
<h4 id="org9fab3a3"><span class="section-number-4">2.15.5</span> Pomodoro</h4>
<div class="outline-text-4" id="text-2-15-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-pomodoro
  :config
  (setq org-pomodoro-start-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
  (setq org-pomodoro-short-break-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
  (setq org-pomodoro-long-break-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav"))
  (setq org-pomodoro-finished-sound (expand-file-name "~/MyLife/Emacs/sounds/meditation_bell.wav")))
;; org-pomodoro use sound-wav pavkage to play the sound
(use-package sound-wav)

</pre>
</div>
</div>
</div>

<div id="outline-container-orge6c5772" class="outline-4">
<h4 id="orge6c5772"><span class="section-number-4">2.15.6</span> tracking habits</h4>
<div class="outline-text-4" id="text-2-15-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'org-modules 'org-habit)
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bd442f" class="outline-4">
<h4 id="org7bd442f"><span class="section-number-4">2.15.7</span> Auto insert newline</h4>
<div class="outline-text-4" id="text-2-15-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'org-mode-hook '(lambda () (setq fill-column 80)))
(add-hook 'org-mode-hook 'auto-fill-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc12f545" class="outline-4">
<h4 id="orgc12f545"><span class="section-number-4">2.15.8</span> org-capture-template</h4>
<div class="outline-text-4" id="text-2-15-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-capture-templates
'(
  ("t" "Tasks")
  ("tt" "TODO" entry (file+headline "GTD.org" "Tasks") "* TODO %?\n %i\n %a")
  ("T" "Thoughts")
  ("TT" "Thought  To be done" entry (file+headline "GTD.org" "未实现的想法") "* %?\n" :jump-to-captured t)
  ("d" "Drills")
  ("dE" "Drills for English" entry (file+headline "GTD.org" "English")  "* %? :drill:")
  ("dP" "Drills for Python" entry (file+headline "~/MyLife/Python/Learning_Python/README.org" "练习题") "* %? :drill:\n** Answer\n** Note\n" :jump-to-captured t)
  )
)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b7ab19" class="outline-4">
<h4 id="org4b7ab19"><span class="section-number-4">2.15.9</span> Encrypt</h4>
<div class="outline-text-4" id="text-2-15-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(require 'org-crypt)
(org-crypt-use-before-save-magic)
(setq org-tags-exclude-from-inheritance (quote ("crypt")))
;; GPG key to use for encryption
;; Either the Key ID or set to nil to use symmetric encryption.
(setq org-crypt-key "kamisama")
</pre>
</div>
</div>
</div>
</div>
